In [3]:
import pandas as pd
import numpy as np

# Series创建
左边是索引（index），右边是values（数据）
pandas有两个最主要的数据结构：series和dataframe
series可以保存任何数据类型：int、str、float...

In [9]:
#1、通过list创建
s1=pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
#2、通过numpy数组创建
a=np.arange(1,6)
a

array([1, 2, 3, 4, 5])

In [12]:
a1=pd.Series(a)#将numpy数组放在series中
a1

0    1
1    2
2    3
3    4
4    5
dtype: int32

# 指定索引

In [15]:
a1=pd.Series(a,index=['a','b','c','d','e'])
a1

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [21]:
#3、通过字典创建
dict={'name':'李宁','age':'18','class':'3班'}
s3=pd.Series(dict,index=['name','age','class','sex'])

s3

name      李宁
age       18
class     3班
sex      NaN
dtype: object

# Series的基本用法

In [22]:
#isnull是判断是否为空，空就是True
s3.isnull()

name     False
age      False
class    False
sex       True
dtype: bool

In [23]:
#notnull判断是否不为空，不空就是True
s3.notnull()

name      True
age       True
class     True
sex      False
dtype: bool

In [25]:
#通过索引获取数据
print(s3.index)
print(s3.values)

Index(['name', 'age', 'class', 'sex'], dtype='object')
['李宁' '18' '3班' nan]

In [26]:
#通过下标获取数据
s3[1]#第一行对应的数据

'18'

In [27]:
#通过标签名获取数据
s3['age']

'18'

In [28]:
#通过切片获取数据
s3[1:3]#第一行到第

age      18
class    3班
dtype: object

In [29]:
#通过标签获取数据（注意的是：切片不包含末端的数据；标签是包含末端数据的）
s3['name':'class']

name     李宁
age      18
class    3班
dtype: object

In [32]:
#name属性
a1.name='temp'#对象名
a1.index.name='year'#对象索引名
a1

year
a    1
b    2
c    3
d    4
e    5
Name: temp, dtype: int32

In [34]:
#默认前5行，（）里可以加数字
a1.head(3)

year
a    1
b    2
c    3
Name: temp, dtype: int32

In [35]:
#默认后5行，（）里可以加数字
a1.tail(2)

year
d    4
e    5
Name: temp, dtype: int32

# DataFrame创建

In [40]:
#构建一个字典
date={'a':[1,2,3,4],'b':(5,6,7,8),'c':np.arange(9,13)}
date

{'a': [1, 2, 3, 4], 'b': (5, 6, 7, 8), 'c': array([ 9, 10, 11, 12])}

In [44]:
frame=pd.DataFrame(date)
frame

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [45]:
frame.index#查看属性

RangeIndex(start=0, stop=4, step=1)

In [46]:
#Columns查看行索引
frame.columns

Index(['a', 'b', 'c'], dtype='object')

In [47]:
#values查看值
frame.values

array([[ 1,  5,  9],
       [ 2,  6, 10],
       [ 3,  7, 11],
       [ 4,  8, 12]], dtype=int64)

In [53]:
#指定index
frame1=pd.DataFrame(date,index=['A','B','C','D'])
frame1

   a  b   c
A  1  5   9
B  2  6  10
C  3  7  11
D  4  8  12

In [63]:
#指定行索引
frame2=pd.DataFrame(date,index=['A','B','C','D'],columns=['a','b','c','d'])
frame2

   a  b   c    d
A  1  5   9  NaN
B  2  6  10  NaN
C  3  7  11  NaN
D  4  8  12  NaN

In [68]:
#series构成的字典构造dataframe
p=pd.DataFrame({'a':pd.Series(np.arange(3)),
               'b':pd.Series(np.arange(3,5))}
              )
p

   a    b
0  0  3.0
1  1  4.0
2  2  NaN

In [17]:
#索引对象Index
ps1=pd.Series(range(5),index=['a','b','c','d','e'])
ps1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [9]:
pd1=pd.DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['A','B','C'])
pd1

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8

In [18]:
#索引的一些基本操作
#1、重新索引：reindex,创建一个新索引的对象
ps2=ps1.reindex(['a','b','c','d','e','f'])
ps2

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    NaN
dtype: float64

In [19]:
#重建行索引
pd2=pd1.reindex(['a','b','c','d'])
pd2

     A    B    C
a  0.0  1.0  2.0
b  3.0  4.0  5.0
c  6.0  7.0  8.0
d  NaN  NaN  NaN

In [22]:
#重建列索引
pd3=pd1.reindex(columns=['C','B','A'])
pd3

   C  B  A
a  2  1  0
b  5  4  3
c  8  7  6

**增

In [23]:
ps1

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [25]:
ps1['g']=9
ps1

a    0
b    1
c    2
d    3
e    4
g    9
dtype: int64

In [26]:
s1=pd.Series({'f':999})
ps3=ps1.append(s1)
ps3

a      0
b      1
c      2
d      3
e      4
g      9
f    999
dtype: int64

In [27]:
pd1

   A  B  C
a  0  1  2
b  3  4  5
c  6  7  8

In [29]:
#增加列
pd1[4]=[10,11,12]
pd1

   A  B  C   4
a  0  1  2  10
b  3  4  5  11
c  6  7  8  12

In [30]:
#插入
pd1.insert(0,'E',[9,99,999])
pd1

     E  A  B  C   4
a    9  0  1  2  10
b   99  3  4  5  11
c  999  6  7  8  12

In [32]:
#增加行
#标签索引loc
pd1.loc['d']=[1,1,1,1,1]
pd1

     E  A  B  C   4
a    9  0  1  2  10
b   99  3  4  5  11
c  999  6  7  8  12
d    1  1  1  1   1

In [33]:
#删操作
ps1

a    0
b    1
c    2
d    3
e    4
g    9
dtype: int64

In [40]:
del ps1['c']
ps1

d    3
e    4
g    9
dtype: int64